case/validation/validationSphereOrigin/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (0 -1 -1)
    (2.1 -1 -1)
    (2.1 1 -1)
    (0 1 -1)
    (0 -1 1)
    (2.1 -1 1)
    (2.1 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (105 100 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
	    (2 6 5 1)
        );
    }
//    bottom
//    {
//        type wall;
//        faces
//        (
//            (0 3 2 1)
//        );
//    }
//    top
//    {
//        type wall;
//        faces
//        (
//             (4 5 6 7)
//        );
//    }
    periodicWalls
    {
        type symmetry;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (1 5 4 0)
            (3 7 6 2)
        );
    }
//    back
//    {
//        type wall;
//        faces
//        (
//            (3 7 6 2)
//        );
//    }
);

// ************************************************************************* //
