case/validation/validationSphereOrigin/constant/inputParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      inputParameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
Mv                  233.38;
pKsp                9.97;
gamma               32.9e-3;
Vmol                47.95e-6;
lnA                 18.2;
K                   1.479e-9;
Cactivate           0.0105;
diffInLiquid        1.4e-9;
smoothSurface       false;
smoothAreaDensity   20.0;
alphaSolidMin       0.99;
Cu                  1e30;
nucleation          false;
debug               false;

// ************************************************************************* //
